src/cf/Catalogs/CRM_СпискиРассылок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_СпискиРассылок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗагруженИзMSExchange</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
								<v8:Type>cfg:CatalogRef.CRM_СпискиРассылок</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКонтакта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/CRM_СпискиРассылок/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Функция ПолучитьСоставСпискаРассылки(Ссылка, МассивРезультат = Неопределено, МассивОбработанныхСписков = Неопределено) Экспорт
	Если МассивРезультат = Неопределено Тогда
		МассивРезультат = Новый Массив();
	КонецЕсли;
	Если МассивОбработанныхСписков = Неопределено Тогда
		МассивОбработанныхСписков = Новый Массив();
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Состав.Адрес КАК Адрес,
	|	Состав.Контакт КАК Контакт,
	|	Состав.КонтактСтрокой КАК КонтактСтрокой
	|ИЗ
	|	Справочник.CRM_СпискиРассылок.Состав КАК Состав
	|ГДЕ
	|	Состав.Ссылка = &Ссылка
	|	И НЕ Состав.Ссылка.ПометкаУдаления");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.Адрес) И Не ЗначениеЗаполнено(Выборка.Контакт) Тогда
			Продолжить;
		КонецЕсли;
		
		Если	ТипЗнч(Выборка.Контакт) = Тип("СправочникСсылка.CRM_СпискиРассылок")
			И	МассивОбработанныхСписков.Найти(Выборка.Контакт) = Неопределено Тогда
			//
			МассивОбработанныхСписков.Добавить(Выборка.Контакт);
			ПолучитьСоставСпискаРассылки(Выборка.Контакт, МассивРезультат, МассивОбработанныхСписков);
		Иначе
			МассивРезультат.Добавить(Новый Структура("Адрес,Контакт", Выборка.Адрес, ?(ЗначениеЗаполнено(Выборка.Контакт), Выборка.Контакт, 
				?(ЗначениеЗаполнено(Выборка.КонтактСтрокой),Выборка.КонтактСтрокой,Неопределено))));
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивРезультат;
КонецФункции
#КонецЕсли
